In [77]:
import pandas as pd
d = {'roll no': pd.Series([101, 102, 103]), 'name':pd.Series(['anu', 'swati', 'harneet']), 'marks': pd.Series([10, 20, 30])}
df = pd.DataFrame(d)
df

   marks     name  roll no
0     10      anu      101
1     20    swati      102
2     30  harneet      103

In [9]:
df['gm'] = df['marks']*(1/10)
df

   marks     name  roll no   gm
0     10      anu      101  1.0
1     20    swati      102  2.0
2     30  harneet      103  3.0

In [78]:
df.insert(1, 'gm', df['marks']*10/100)

In [79]:
df

   marks   gm     name  roll no
0     10  1.0      anu      101
1     20  2.0    swati      102
2     30  3.0  harneet      103

In [32]:
df.pop('gm')
df

   marks     name  roll no
0     10      anu      101
1     20    swati      102
2     30  harneet      103

In [29]:
df.drop(1)

   marks     name  roll no
0     10      anu      101
2     30  harneet      103

In [33]:
df.drop([0,1])

   marks     name  roll no
2     30  harneet      103

In [61]:
df.drop(columns="marks")

TypeError: drop() got an unexpected keyword argument 'columns'

In [44]:
df.drop(['marks', 'gm'], axis = 1)

      name  roll no
0      anu      101
1    swati      102
2  harneet      103

In [65]:
df.drop?

In [68]:
d = df[df.name != 'anu']
d

   marks   gm     name  roll no
1     20  2.0    swati      102
2     30  3.0  harneet      103

In [74]:
df[df.name != 'anu'].drop(1)
d

   marks   gm     name  roll no
1     20  2.0    swati      102
2     30  3.0  harneet      103

In [82]:
# to delete top 2 rows
df[:-1]

   marks   gm   name  roll no
0     10  1.0    anu      101
1     20  2.0  swati      102

In [83]:
df[1:]

   marks   gm     name  roll no
1     20  2.0    swati      102
2     30  3.0  harneet      103